Revit 2024 API
SymbolTypeId.DegreeRInterval Property
 Symbol °R, indicating unit Rankine interval.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId DegreeRInterval { get; }
Visual Basic
Public Shared ReadOnly Property DegreeRInterval As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DegreeRInterval {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace